{
  "exercises": [
    {
      "category": "Squat",
      "category description": "Squat",
      "id": 1,
      "name": "Goblet Squat",
      "description": "Level: Beginner | Body parts: Quadriceps | Equipment: Kettlebells",
      "image": "imageurl",
      "video": "https://drive.google.com/open?id=1yU2N7s8-yS-EaKIVmplADylVW0d6-sFU",
      "steps": [
        {
          "stepDescription": "Step1:Stand holding a light kettlebell by the horns close to your chest. This will be your starting position."
        },
        {
          "stepDescription": "Step2:Squat down between your legs until your hamstrings are on your calves. Keep your chest and head up and your back straight."
        },
        {
          "stepDescription": "Step3:At the bottom position, pause and use your elbows to push your knees out. Return to the starting position, and repeat for 10-20 repetitions."
        }
      ]
    },

    {
      "category": "Squat",
      "category description": "Squat",
      "id": 2,
      "name": "Split Squat",
      "description": "Level: Intermediate | Equipment: Bench, Dumbbells | Body parts: Glutes, Hamstrings, Quads",
      "image": "imageurl",
      "video": "https://drive.google.com/file/d/10UyaTa62hHPa5zJgPEmhnhFs6l5veYw1/view",
      "steps": [
        {
          "stepDescription": "Step1:Hold a dumbbell in each hand with your arms fully extended at your sides and your palms facing each other. With your feet hip-width apart, place the instep of your rear foot on a bench. Your feet should be approximately three feet apart."
        },
        {
          "stepDescription": "Step2:Lower your hips toward the floor so that your rear knee comes close to the floor. Pause and drive through your front heel to return to the starting position."
        }
      ]
    },

    {
      "category": "Pull",
      "category description": "UpperBody Pull Exercise",
      "id": 3,
      "name": "One-Arm Dumbbell Row",
      "description": "Level: Beginner | Body parts: Middle Back | Equipment: Dumbbell",
      "image": "imageurl",
      "video": "https://drive.google.com/open?id=1pzfIgVbFkIlbMmMjZ7PUd53RaPZu4r5t",
      "steps": [
        {
          "stepDescription": "Step1:Pull the resistance straight up to the side of your chest, keeping your upper arm close to your side and keeping the torso stationary. Breathe out as you perform this step. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. Also, make sure that the force is performed with the back muscles and not the arms. Finally, the upper torso should remain stationary and only the arms should move. The forearms should do no other work except for holding the dumbbell; therefore do not try to pull the dumbbell up using the forearms."
        },
        {
          "stepDescription": "Step2:Lower the resistance straight down to the starting position. Breathe in as you perform this step."
        },
        {
          "stepDescription": "Step3:Repeat the movement for the specified amount of repetitions."
        },
        {
          "stepDescription": "Step4:Switch sides and repeat again with the other arm."
        }

      ]
    },

    {
      "category": "Pull",
      "category description": "UpperBody Pull Exercise",
      "id": 4,
      "name": "Standing Dumbbell Upright Row",
      "description": "Level: Beginner | Body Part: Traps Muscles Equipment: Dumbbell",
      "image": "imageurl",
      "video": "https://drive.google.com/open?id=10gWLhEw1KWtr8mP7x5075tnoOs1FmQN8",
      "steps": [
        {
          "stepDescription": "Step1:Grasp a dumbbell in each hand with a pronated (palms forward) grip that is slightly less than shoulder width. The dumbbells should be resting on top of your thighs."
        },
        {
          "stepDescription": "Step2:Use your side shoulders to lift the dumbbells as you exhale. The dumbbells should be close to the body as you move it up and the elbows should drive the motion."
        },
        {
          "stepDescription": "Step3:Lower the dumbbells back down slowly to the starting position. Inhale as you perform this portion of the movement."
        },
        {
          "stepDescription": "Step4:Repeat for the recommended amount of repetitions."
        }
      ]
    },

    {
      "category": "Push",
      "category description": "UpperBody Push Exercise",
      "id": 5,
      "name": "Standing Dumbbell Press",
      "description": "Level: Beginner | Body Parts: Shoulders | Equipment: Dumbbell",
      "image": "imageurl",
      "video": "https://drive.google.com/open?id=1ONMX-3nKgwk2v9JLlpoE-VSDz3Rl8MUH",
      "steps": [
        {
          "stepDescription": "Step1:Standing with your feet shoulder width apart, take a dumbbell in each hand. Raise the dumbbells to head height, the elbows out and about 90 degrees. This will be your starting position."
        },
        {
          "stepDescription": "Step2:Maintaining strict technique with no leg drive or leaning back, extend through the elbow to raise the weights together directly above your head."
        },
        {
          "stepDescription": "Step3:Pause, and slowly return the weight to the starting position"
        }
      ]
    }

  ]
}